Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Properties
The ControlPolycurve type exposes the following members.
Properties
Name | Description
Color
 Gets or sets color of the Polycurve.
Geometry
 Gets or sets geometry list that defines geometry of the polycurve.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LineType
 Gets or sets the line type of the polycurve.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Top
See Also
Reference
ControlPolycurve Class
Tekla.Structures.Model Namespace